itog/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисления</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисления</name>
      <type>
        <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>DefinedType.Процент</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

itog/src/Documents/НачислениеЗарплаты/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДопНачисленияВидНачисленияПриИзменении(Элемент)
	ТекДанные = Элементы.ДопНачисления.ТекущиеДанные;
	Если Строка(ТекДанные.ВидНачисления) = "Премия"  Тогда 
		ТекДанные.Процент = 1;
		ТекДанные.Размер = РассичатьПремиюНаСервере(ТекДанные.Сотрудник,Объект.Дата,ТекДанные.Процент); 
	КонецЕсли;
КонецПроцедуры


 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция РассичатьПремиюНаСервере(Сотрудник,Месяц,Процент)
	Возврат Документы.НачислениеЗарплаты.РассчитатьПремию(Сотрудник,ДобавитьМесяц(Месяц,-2),Процент); 
КонецФункции


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Дата <> Дата(1,1,1) И Объект.Месяц = 0 Тогда
		Объект.Месяц = Месяц(ДобавитьМесяц(Объект.Дата,-1));
	Иначе
		Объект.Месяц = Месяц(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	Объект.Дата = ДобавитьМесяц(Объект.Дата,-Месяц(Объект.Дата)+Объект.Месяц+1);
КонецПроцедуры

&НаКлиенте
Процедура ДопНачисленияПроцентПриИзменении(Элемент) 
	ТекДанные = Элементы.ДопНачисления.ТекущиеДанные;
	Если Строка(ТекДанные.ВидНачисления) = "Премия"  Тогда
		ТекДанные.Размер = РассичатьПремиюНаСервере(ТекДанные.Сотрудник,Объект.Дата,ТекДанные.Процент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияВидНачисленияПриИзменении(Элемент)
	ТекДанные = Элементы.Начисления.ТекущиеДанные;
	Если Строка(ТекДанные.ВидНачисления) = "Оклад"  Тогда
		ТекДанные.ДатаНачала = НачалоМесяца(ДобавитьМесяц(Объект.Дата,-1));
		ТекДанные.ДатаОкончания = КонецМесяца(ДобавитьМесяц(Объект.Дата,-1))
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры
